Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/include/cy_wcm.h
    CY_WCM_SECURITY_IBSS_OPEN           = ( IBSS_ENABLED ),                                                    /**< Open security on IBSS ad hoc network.                  */
    CY_WCM_SECURITY_WPS_SECURE          = ( WPS_ENABLED | AES_ENABLED),                                        /**< WPS with AES security.                                 */

    CY_WCM_SECURITY_UNKNOWN             = -1,                                                                  /**< Returned by \ref cy_wcm_scan_result_callback_t if security is unknown. Do not pass this to the join function! */

    CY_WCM_SECURITY_FORCE_32_BIT        = 0x7fffffff                                                           /**< Exists only to force whd_security_t type to 32 bits.   */
} cy_wcm_security_t;

/**
 * Enumeration of 802.11 radio bands
 */
typedef enum
{
    CY_WCM_WIFI_BAND_ANY = 0,     /**< Platform will choose an available band.  */
    CY_WCM_WIFI_BAND_5GHZ,        /**< 5-GHz radio band.                            */
    CY_WCM_WIFI_BAND_2_4GHZ,      /**< 2.4-GHz radio band.                          */
    CY_WCM_WIFI_BAND_6GHZ,        /**< 6-GHz radio band.                            */
} cy_wcm_wifi_band_t;

/**
 * Enumeration of TWT profile type
 */
typedef enum
{
    CY_WCM_ITWT_PROFILE_NONE = 0,  /**< TWT is disabled.  */
    CY_WCM_ITWT_PROFILE_IDLE,      /**< Idle profile.     */
    CY_WCM_ITWT_PROFILE_ACTIVE,    /**< Active profile.   */
} cy_wcm_itwt_profile_t;

/**
 * Enumeration of RSSI range
 */
typedef enum
{
    CY_WCM_SCAN_RSSI_FAIR      = -90,      /**< Wi-Fi RSSI values greater than -90 dBm. */
    CY_WCM_SCAN_RSSI_GOOD      = -60,      /**< Wi-Fi RSSI values greater than -60 dBm. */
    CY_WCM_SCAN_RSSI_EXCELLENT = -40       /**< Wi-Fi RSSI values greater than -40 dBm. */
} cy_wcm_scan_rssi_range_t;


/**
 * Enumeration of WCM interfaces types
 */
typedef enum
{
    CY_WCM_INTERFACE_TYPE_STA = 0,    /**< STA or client interface. */
    CY_WCM_INTERFACE_TYPE_AP,         /**< SoftAP interface. */
    CY_WCM_INTERFACE_TYPE_AP_STA      /**< Concurrent AP + STA mode. */
} cy_wcm_interface_t;

/**
 * Enumeration of WCM Powersave Modes
 */
typedef enum
{
    CY_WCM_NO_POWERSAVE_MODE  = NO_POWERSAVE_MODE,   /**< No power savings */
    CY_WCM_PM1_POWERSAVE_MODE = PM1_POWERSAVE_MODE,  /**< Powersave mode on specified interface without regard for throughput reduction */
    CY_WCM_PM2_POWERSAVE_MODE = PM2_POWERSAVE_MODE,  /**< Powersave mode on specified interface with High throughput */
} cy_wcm_powersave_mode_t;

/**
 * Enumeration of scan status
 */
typedef enum
{
    CY_WCM_SCAN_INCOMPLETE,                /**< Scan is in progress; more scan results will be returned. */
    CY_WCM_SCAN_COMPLETE                   /**< Scan is completed. */
} cy_wcm_scan_status_t;

/**
 * Enumeration of WPS connection modes
 */
typedef enum
{
    CY_WCM_WPS_PBC_MODE,  /**< Push button mode. */
    CY_WCM_WPS_PIN_MODE   /**< PIN mode.         */
} cy_wcm_wps_mode_t;

/**
 * Enumeration of WPS configuration method
 */
typedef enum
{
    CY_WCM_WPS_CONFIG_USBA                  = 0x0001, /**< USB configuration. */
    CY_WCM_WPS_CONFIG_ETHERNET              = 0x0002, /**< Ethernet configuration. */
    CY_WCM_WPS_CONFIG_LABEL                 = 0x0004, /**< Label configuration. */
    CY_WCM_WPS_CONFIG_DISPLAY               = 0x0008, /**< Display configuration. */
    CY_WCM_WPS_CONFIG_EXTERNAL_NFC_TOKEN    = 0x0010, /**< External NFC configuration. */
    CY_WCM_WPS_CONFIG_INTEGRATED_NFC_TOKEN  = 0x0020, /**< Internal NFC configuration. */
    CY_WCM_WPS_CONFIG_NFC_INTERFACE         = 0x0040, /**< NFC interface. */
    CY_WCM_WPS_CONFIG_PUSH_BUTTON           = 0x0080, /**< Push button configuration. */
    CY_WCM_WPS_CONFIG_KEYPAD                = 0x0100, /**< Keypad configuration. */
    CY_WCM_WPS_CONFIG_VIRTUAL_PUSH_BUTTON   = 0x0280, /**< Virtual push button configuration. */
    CY_WCM_WPS_CONFIG_PHYSICAL_PUSH_BUTTON  = 0x0480, /**< Physical push button configuration. */
    CY_WCM_WPS_CONFIG_VIRTUAL_DISPLAY_PIN   = 0x2008, /**< Virtual display pin configuration. */
    CY_WCM_WPS_CONFIG_PHYSICAL_DISPLAY_PIN  = 0x4008  /**< Physical display pin configuration. */
} cy_wcm_wps_configuration_method_t;


/**
 * Enumeration of WPS authentication types
 */
typedef enum
{
    CY_WCM_WPS_OPEN_AUTHENTICATION               = 0x0001, /**< Authentication type OPEN. */
    CY_WCM_WPS_WPA_PSK_AUTHENTICATION            = 0x0002, /**< WPA-PSK authentication type - Deprecated in version 2.0. */
    CY_WCM_WPS_SHARED_AUTHENTICATION             = 0x0004, /**< WPS-SHARED authentication type - Deprecated in version 2.0. */
    CY_WCM_WPS_WPA_ENTERPRISE_AUTHENTICATION     = 0x0008, /**< WPA-ENTERPRISE authentication type - Deprecated in version 2.0. */
    CY_WCM_WPS_WPA2_ENTERPRISE_AUTHENTICATION    = 0x0010, /**< WPA2-ENTERPRISE authentication type. */
    CY_WCM_WPS_WPA2_PSK_AUTHENTICATION           = 0x0020, /**< WPA2-PSK authentication type. */
    CY_WCM_WPS_WPA2_WPA_PSK_MIXED_AUTHENTICATION = 0x0022, /**< WPA2-WPA-PSK authentication type. */
} cy_wcm_wps_authentication_type_t;

/**
 * Enumeration of WPS encryption type
 */
typedef enum
{
    CY_WCM_WPS_MIXED_ENCRYPTION = 0x000c, /**< MIXED encryption. */
    CY_WCM_WPS_AES_ENCRYPTION   = 0x0008, /**< AES encryption. */
    CY_WCM_WPS_TKIP_ENCRYPTION  = 0x0004, /**< TKIP encryption - Deprecated in WSC 2.0. */
    CY_WCM_WPS_WEP_ENCRYPTION   = 0x0002, /**< WEP encryption - Deprecated in WSC 2.0. */
    CY_WCM_WPS_NO_ENCRYPTION    = 0x0001, /**< OPEN - No encryption. */
    CY_WCM_WPS_NO_UNDEFINED     = 0x0000, /**< Undefined encryption type. */
} cy_wcm_wps_encryption_type_t;

/**
 * Enumeration of WPS device category from the WSC 2.0 spec
 */
typedef enum
{
    CY_WCM_WPS_DEVICE_COMPUTER               = 1,     /**< Computer devices.               */
    CY_WCM_WPS_DEVICE_INPUT                  = 2,     /**< Input devices.                  */
    CY_WCM_WPS_DEVICE_PRINT_SCAN_FAX_COPY    = 3,     /**< Devices such as printers, scanners, faxes and copiers.    */
    CY_WCM_WPS_DEVICE_CAMERA                 = 4,     /**< Camera devices.                 */
    CY_WCM_WPS_DEVICE_STORAGE                = 5,     /**< Storage devices.                */
    CY_WCM_WPS_DEVICE_NETWORK_INFRASTRUCTURE = 6,     /**< Network infrastructure devices. */
    CY_WCM_WPS_DEVICE_DISPLAY                = 7,     /**< Display devices.                */
    CY_WCM_WPS_DEVICE_MULTIMEDIA             = 8,     /**< Multimedia devices.             */
    CY_WCM_WPS_DEVICE_GAMING                 = 9,     /**< Gaming devices.                 */
    CY_WCM_WPS_DEVICE_TELEPHONE              = 10,    /**< Telephony devices.              */
    CY_WCM_WPS_DEVICE_AUDIO                  = 11,    /**< Audio devices.                  */
    CY_WCM_WPS_DEVICE_DOCK                   = 12,    /**< Docking devices.                */
    CY_WCM_WPS_DEVICE_OTHER                  = 0xFF,  /**< Other devices.                  */
} cy_wcm_wps_device_category_t;

/**
 * Enumeration of WCM events
 */
typedef enum
{
    CY_WCM_EVENT_CONNECTING  = 0,    /**< STA connecting to an AP.         */
    CY_WCM_EVENT_CONNECTED,          /**< STA connected to the AP.         */
    CY_WCM_EVENT_CONNECT_FAILED,     /**< STA connection to the AP failed. */
    CY_WCM_EVENT_RECONNECTED,        /**< STA reconnected to the AP.       */
    CY_WCM_EVENT_DISCONNECTED,       /**< STA disconnected from the AP.    */
    CY_WCM_EVENT_IP_CHANGED,         /**< IP address change event. This event is notified after connection, re-connection, and IP address change due to DHCP renewal. */
    CY_WCM_EVENT_INITIATED_RETRY,    /**< Indicates that WCM will initiate a retry logic to re-connect to the AP */
    CY_WCM_EVENT_STA_JOINED_SOFTAP,  /**< An STA device connected to SoftAP. */
    CY_WCM_EVENT_STA_LEFT_SOFTAP    /**< An STA device disconnected from SoftAP. */
} cy_wcm_event_t;

/**
 * Enumeration of scan filter types
 */
typedef enum
{
   CY_WCM_SCAN_FILTER_TYPE_SSID = 0,   /**< SSID-based scan filtering. */
   CY_WCM_SCAN_FILTER_TYPE_MAC,        /**< MAC-based scan filtering.  */
   CY_WCM_SCAN_FILTER_TYPE_BAND,       /**< Band-based scan filtering. */
   CY_WCM_SCAN_FILTER_TYPE_RSSI,       /**< RSSI-based scan filtering. */
}cy_wcm_scan_filter_type_t;

/**
 * Enumeration of network types
 */
typedef enum
{
    CY_WCM_BSS_TYPE_INFRASTRUCTURE =  0, /**< Infrastructure network.                  */
    CY_WCM_BSS_TYPE_ADHOC          =  1, /**< 802.11 ad hoc IBSS network.              */
    CY_WCM_BSS_TYPE_ANY            =  2, /**< Either infrastructure or ad hoc network. */
    CY_WCM_BSS_TYPE_MESH           =  3, /**< 802.11 mesh network.                     */
    CY_WCM_BSS_TYPE_UNKNOWN        = -1  /**< Returned by \ref cy_wcm_scan_result_callback_t if BSS type is unknown. Do not pass this to the Join function. */
} cy_wcm_bss_type_t;

/**
 * Enumeration of applicable packet mask bits for custom information elements (IEs)
 */
typedef enum
{
    CY_WCM_IE_MASK_BEACON         = 0x1,  /**< Denotes mask for beacon packet.                  */
    CY_WCM_IE_MASK_PROBE_RESPONSE = 0x2,  /**< Denotes mask for probe response packet.          */
    CY_WCM_IE_MASK_ASSOC_RESPONSE = 0x4,  /**< Denotes mask for association response packet.    */
    CY_WCM_IE_MASK_AUTH_RESPONSE  = 0x8,  /**< Denotes mask for authentication response packet. */
    CY_WCM_IE_MASK_PROBE_REQUEST  = 0x10, /**< Denotes mask for probe request packet.           */
    CY_WCM_IE_MASK_ASSOC_REQUEST  = 0x20, /**< Denotes mask for association request packet.     */
    CY_WCM_IE_MASK_CUSTOM         = 0x100 /**< Denotes mask for custom IE identifier.           */
} cy_wcm_ie_mask_t;

/** \} group_wcm_enums */

/**
 * \addtogroup group_wcm_typedefs
 * \{
 */
/******************************************************
 *                      Typedefs
 ******************************************************/

typedef uint8_t cy_wcm_ssid_t[CY_WCM_MAX_SSID_LEN + 1];              /**< SSID name (AP name in null-terminated string format). */

typedef uint8_t cy_wcm_mac_t[CY_WCM_MAC_ADDR_LEN];                   /**< Unique 6-byte MAC address represented in network byte order. */

typedef uint8_t cy_wcm_passphrase_t[CY_WCM_MAX_PASSPHRASE_LEN + 1];  /**< Passphrase in null-terminated string format. */

/** \} group_wcm_typedefs */

/**
 * \addtogroup group_wcm_structures
 * \{
 */

/******************************************************
 *             Structures
 ******************************************************/

/**
 * Structure used to pass WPS configuration parameters to \ref cy_wcm_wps_enrollee.
 * Password is mandatory only for CY_WCM_WPS_PIN mode and not used when mode is CY_WCM_WPS_PBC.
 */
typedef struct
{
    cy_wcm_wps_mode_t mode;        /**< WPS mode. */
    char*             password;    /**< Used only for CY_WCM_WPS_PIN mode. */
} cy_wcm_wps_config_t;

/**
 * Structure used to pass WCM configuration to \ref cy_wcm_init.
 */
typedef struct
{
    cy_wcm_interface_t interface;  /**< Interface type. */
} cy_wcm_config_t;


/**
 * Structure used to receive the IP address information from \ref cy_wcm_connect_ap.
 */
typedef struct
{
    cy_wcm_ip_version_t version;  /**< IP version. */
    union
    {
        uint32_t v4;     /**< IPv4 address in network byte order. */
        uint32_t v6[4];  /**< IPv6 address in network byte order. */
    } ip;                /**< IP address bytes. */
} cy_wcm_ip_address_t;

/**
 * Structure used to receive the IP address of the STA or MAC address of the connected STA to SoftAP through the callback registered using \ref cy_wcm_register_event_callback.
 */
typedef union
{
    cy_wcm_ip_address_t ip_addr;  /**< Contains the IP address for the CY_WCM_EVENT_IP_CHANGED event. */
    cy_wcm_mac_t        sta_mac;  /**< MAC address of the STA for the CY_WCM_EVENT_STA_JOINED or CY_WCM_EVENT_STA_LEFT */
    cy_wcm_reason_code  reason;   /**< Reason code which specifies the reason for disconnection. */
} cy_wcm_event_data_t;


/**
 * Structure used for providing the AP credential to connect to a AP using \ref cy_wcm_connect_ap.
 */
typedef struct
{
    cy_wcm_ssid_t        SSID;                /**< SSID of the Wi-Fi network to join; should be a null-terminated string. */
    cy_wcm_passphrase_t  password;            /**< Password needed to join the AP; should be a null-terminated string. */
    cy_wcm_security_t    security;            /**< Wi-Fi Security. @see cy_wcm_security_t. */
} cy_wcm_ap_credentials_t;

/**
 * Structure used to pass the static IP address information to \ref cy_wcm_connect_ap.
 *
 */
typedef struct
{
    cy_wcm_ip_address_t  ip_address;  /**< IP address.      */
    cy_wcm_ip_address_t  gateway;     /**< Gateway address. */
    cy_wcm_ip_address_t  netmask;     /**< Netmask.         */
} cy_wcm_ip_setting_t;

/**
 * Structure used to pass the Wi-Fi connection parameter information to \ref cy_wcm_connect_ap.
 *
 */
typedef struct
{
    cy_wcm_ap_credentials_t  ap_credentials;       /**< AP credentials. */
    cy_wcm_mac_t             BSSID;                /**< MAC address of the AP (optional). */
    cy_wcm_ip_setting_t      *static_ip_settings;  /**< Static IP settings of the device (optional). */
    cy_wcm_wifi_band_t       band;                 /**< Radio band to be connected (optional). */
    cy_wcm_itwt_profile_t    itwt_profile;         /**< Individual TWT profile */
} cy_wcm_connect_params_t;

/**
 * Structure used to pass scan filters to \ref cy_wcm_start_scan.
 */
typedef struct
{
    cy_wcm_scan_filter_type_t      mode;        /**< Scan filter mode. */
    union
    {
        cy_wcm_ssid_t              SSID;        /**< SSID. */
        cy_wcm_mac_t               BSSID;       /**< MAC address of AP. */
        cy_wcm_wifi_band_t         band;        /**< Radio band. */
        cy_wcm_scan_rssi_range_t   rssi_range;  /**< RSSI range. */
    } param;                                    /**< Parameter specific to scan filter mode.  */
} cy_wcm_scan_filter_t;


/**
 * Structure used for storing scan results.
 */
typedef struct
{
    cy_wcm_ssid_t                SSID;             /**< SSID (i.e., name of the AP). In case of a hidden AP, SSID.value will be empty and SSID.length will be 0. */
    cy_wcm_mac_t                 BSSID;            /**< Basic Service Set Identification (BSSID), i.e., MAC address of the AP.              */
    int16_t                      signal_strength;  /**< RSSI in dBm. (<-90=Very poor, >-30=Excellent).                                    */
    uint32_t                     max_data_rate;    /**< Maximum data rate in kbps.         */
    cy_wcm_bss_type_t            bss_type;         /**< Network type.  */
    cy_wcm_security_t            security;         /**< Security type.                                 */
    uint8_t                      channel;          /**< Radio channel that the AP beacon was received on.  */
    cy_wcm_wifi_band_t           band;             /**< Radio band.                                                            */
    uint8_t                      ccode[2];         /**< Two-letter ISO country code in network byte order.  */
    uint8_t                      flags;            /**< Indicates whether the scan results are from the same channel if flag is 1; otherwise from the beacon. */
    uint8_t                      *ie_ptr;          /**< Pointer to the received Beacon/Probe Response IE (Information Element).  */
    uint32_t                     ie_len;           /**< Length of the IE.  */
} cy_wcm_scan_result_t;


/**
 * Structure used to pass the device information to \ref cy_wcm_wps_enrollee.
 */
typedef struct
{
    const cy_wcm_wps_device_category_t device_category; /**< Device category.                */
    const uint16_t sub_category;                        /**< Device sub-category.            */
    const char    *device_name;                         /**< Device name.                    */
    const char    *manufacturer;                        /**< Manufacturer details.           */
    const char    *model_name;                          /**< Model name.                     */
    const char    *model_number;                        /**< Model number.                   */
    const char    *serial_number;                       /**< Serial number.                  */
    const uint32_t config_methods;                      /**< Configuration methods.          */
    const uint32_t os_version;                          /**< Operating system version.       */
    const uint16_t authentication_type_flags;           /**< Supported authentication types. */
    const uint16_t encryption_type_flags;               /**< Supported encryption types.     */
    const uint8_t  add_config_methods_to_probe_resp;    /**< Add configuration methods to probe response for Windows enrollees (Not compliant with WPS 2.0). */
} cy_wcm_wps_device_detail_t;

/**
 * Structure used to receive the AP credential after WPS is completed successfully from \ref cy_wcm_wps_enrollee.
 */
typedef struct
{
    cy_wcm_ssid_t         ssid;                                    /**< AP SSID (name) - must be null-terminated. */
    cy_wcm_security_t     security;                                /**< AP security type.                         */
    cy_wcm_passphrase_t   passphrase;                              /**< AP passphrase - must be null-terminated.  */
} cy_wcm_wps_credential_t;

/**
 * Structure used to receive the information of the associated AP from \ref cy_wcm_get_associated_ap_info().
 */
typedef struct
{
    cy_wcm_ssid_t         SSID;             /**< Associated AP name.                                     */
    cy_wcm_mac_t          BSSID;            /**< BSSID (MAC address) of the associated AP.               */
    cy_wcm_security_t     security;         /**< Security of the associated AP. @see cy_wcm_security_t.  */
    uint16_t              channel_width;    /**< Channel width (bandwidth in MHz) of the AP.             */
    int16_t               signal_strength;  /**< RSSI in dBm. (<-90=Very poor, >-30=Excellent).          */
    uint8_t               channel;          /**< Radio channel of the AP.                                */
} cy_wcm_associated_ap_info_t;

/**
 * Structure used to receive the WLAN statistics of the given interface from the time the WLAN driver is up.
 */
typedef struct
{
    uint32_t rx_bytes;   /**< Total received bytes.           */
    uint32_t tx_bytes;   /**< Total transmitted bytes.        */
    uint32_t rx_packets; /**< Total received WLAN packets.    */
    uint32_t tx_packets; /**< Total transmitted WLAN packets. */
    uint32_t tx_retries; /**< Total transmission retries.     */
    uint32_t tx_failed;  /**< Total failed packets.           */
    uint32_t tx_bitrate; /**< Current transmitted data rate in Kbps */
} cy_wcm_wlan_statistics_t;

/**
 * Structure used to fill the vendor information element (IE) as a part of starting SoftAP. \ref cy_wcm_start_ap.
 */
typedef struct
{
    uint8_t         oui[CY_WCM_MAX_IE_LENGTH];   /**< Unique identifier for the IE. */
    uint8_t         subtype;                     /**< Sub-type of the IE. */
    void            *data;                        /**< Pointer to IE data. */
    uint16_t        length;                      /**< IE data length. */
    uint16_t        ie_packet_mask;              /**< Mask of the IE details to be included \ref cy_wcm_ie_mask_t */
} cy_wcm_custom_ie_info_t;

/**
 * Structure used to configure the access point. \ref cy_wcm_start_ap.
 */
typedef struct
{
    cy_wcm_ap_credentials_t  ap_credentials;      /**< AP credentials. */
    cy_wcm_wifi_band_t       band;                /**< Band for the AP. */
    uint8_t                  channel;             /**< Radio channel of the AP. */
    cy_wcm_ip_setting_t      ip_settings;         /**< IP settings of the AP interface. */
    cy_wcm_custom_ie_info_t  *ie_info;            /**< Optional custom IE information to be added to the SoftAP. */
} cy_wcm_ap_config_t;

/** \} group_wcm_structures */

/**
 * \addtogroup group_wcm_typedefs
 * \{
 */
/**
 * Wi-Fi scan result callback function pointer type.
 *
 * @param[in] result_ptr       : A pointer to the scan result; the scan result will be freed once the callback function returns from the application.
 *                               There will not be any scan result when the scan status is CY_WCM_SCAN_COMPLETE.
 *                               For more details on content of result_ptr, see \ref cy_wcm_scan_result_t.
 * @param[in] user_data        : User-provided data.
 * @param[in] status           : Status of the scan process.
 *                               CY_WCM_SCAN_COMPLETE   : Indicates the scan is completed. In this case, the result_ptr will not contain any results.
 *                               CY_WCM_SCAN_INCOMPLETE : Indicates the scan is in progress. In this case, result_ptr contains one of the scan result.
 *
 *
 * Note: The callback function will be executed in the context of the WCM.
 */
typedef void (*cy_wcm_scan_result_callback_t)( cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status );


/**
 * WCM event callback function pointer type; events are invoked when the WHD posts events to WCM.
 * @param[in] event            : WCM events.
 * @param[in] event_data       : A pointer to the event data. The event data will be freed once the callback returns from the application.
 *
 * Note: The callback function will be executed in the context of the WCM.
 */
typedef void (*cy_wcm_event_callback_t)(cy_wcm_event_t event, cy_wcm_event_data_t *event_data);

/** \} group_wcm_typedefs */
/**
 * \addtogroup group_wcm_functions
 * \{
 * * The WCM library internally creates a thread; the created threads are executed with the "CY_RTOS_PRIORITY_ABOVENORMAL" priority. The definition of the CY_RTOS_PRIORITY_ABOVENORMAL macro is located at "libs/abstraction-rtos/include/COMPONENT_FREERTOS/cyabs_rtos_impl.h".
 * * The WCM APIs are thread-safe.
 * * All the WCM APIs except \ref cy_wcm_start_scan are blocking APIs.
 * * \ref cy_wcm_start_scan is a non-blocking API; scan results are delivered via \ref cy_wcm_scan_result_callback_t.
 * * All application callbacks invoked by the WCM will be running in the context of the WCM; the pointers passed as argument in the callback function will be freed once the function returns.
 * * For the APIs that expect \ref cy_wcm_interface_t as an argument, unless a specific interface type has been called out in the description of the API, any valid WCM interface type can be passed as an argument to the API.
 */

/**
 * Initializes the WCM.
 *
 * This function initializes the WCM resources, WHD, and Wi-Fi transport;
 * turns Wi-Fi on; and starts up the network stack. This function should be called before calling other WCM APIs.
 *
 * This function is supported in multi-core environment and it must be called in secondary core application before invoking any virtual WCM APIs.
 * \note The secondary core can invoke this API by passing the config parameter as NULL.
 *
 * @param[in]  config: The configuration to be initialized.
 *
 * @return CY_RSLT_SUCCESS if WCM initialization was successful; returns \ref cy_wcm_error otherwise.
 *
 */
cy_rslt_t cy_wcm_init(cy_wcm_config_t *config);

